use DB_Cinema;
--电影表
--Filmid varchar(20)	not null,	电影编号
--Fname  varchar(40) not null,		电影名称
--Id  varchar(20) not null,			电影类型编号
--[Money] float not null,				价格
--KSTime varchar(20) not null,		开始时间
--JSTime varchar(20) not null,		结束时间
--FilmTid int not null,				电影厅编号
--Remark varchar(200) null			备注

insert into Films(Filmid,Fname,Id,[Money],KSTime,JSTime,FilmTid,Remark)
 values('F0001','流浪地球2','FT2','59','2023-02-07 9:30:00','2023-02-07 11:30:00','T01'
 ,'太阳即将毁灭，人类在地球表面建造出巨大的推进器，寻找新的家园，然而宇宙之路危机四伏，为了拯救地球，流浪地球时代的年轻人再次挺身而出，展开争分夺秒的生死之战...')
insert into Films(Filmid,Fname,Id,[Money],KSTime,JSTime,FilmTid,Remark)
 values('F0002','风再起时','FT1','54','2023-02-07 13:30:00','2023-02-07 15:30:00','T01'
 ,'郭富城、梁朝伟双影帝大银幕首度合作，刺激枪战、权谋博弈、情爱相争，开年首部港片巨制爽燃热映中！')
insert into Films(Filmid,Fname,Id,[Money],KSTime,JSTime,FilmTid,Remark)
 values('F0003','满江红','FT4','59','2023-02-07 16:00:00','2023-02-07 18:00:00','T01'
 ,'张艺谋最新高口碑悬疑喜剧感动热映中，沈腾、易烊千玺、张译、雷佳音、岳云鹏赴局探案有惊有喜，震撼演绎中国式传奇故事！')
insert into Films(Filmid,Fname,Id,[Money],KSTime,JSTime,FilmTid,Remark)
 values('F0004','深海','FT5','54','2023-02-07 19:00:00','2023-02-07 21:00:00','T01'
 ,'大年初一，献给走过长夜的你。为心结所困的少女（参宿）误入梦幻深海世界，与来自“深海”的魔法船长南河，在一段奇幻冒险中寻找生命的答案......《大圣归来》导演田晓鹏7年全新力作，春节档必看巅峰视效大片！')
insert into Films(Filmid,Fname,Id,[Money],KSTime,JSTime,FilmTid,Remark)
 values('F0005','熊出没·伴我"熊芯"','FT4','40','2023-02-07 9:30:00','2023-02-07 11:30:00','T02'
 ,'一个普通的森林夜晚，对小熊大、小熊二宠爱有加的熊妈妈，在一场大火后离开了他们，两熊伤心不已……转眼多年过去，光头强带熊大熊二前往振兴岛参观机器人研究所，却意外得到了熊妈妈的线索，为此熊大、熊二一路探寻…… 熊妈当年为何不告而别？两熊最终是否能找到妈妈？迷雾重重的背后还有怎样的故事？一切谜团等待揭晓。')
 insert into Films(Filmid,Fname,Id,[Money],KSTime,JSTime,FilmTid,Remark)
 values('F0006','无名','FT4','40','2023-02-07 13:30:00','2023-02-07 15:30:00','T02'
 ,'影片通过对上世纪二十年代开始奋斗在上海的中国共产党领导下的中共特科，在隐蔽战线与各方势力殊死较量过程的再现，表现了在走向胜利过程中不可或缺的党的秘密战线上那些无名英雄，他们不可取代的贡献。全面抗战爆发后，中国共产党领导的中共特科在上海周旋于重庆、汪伪、日本间谍机构之间，通过错综复杂的敌后情报系统，策反敌人，获取情报，诛杀汉奸，建立更广泛的统一战线，直至抗战胜利的前夜…...')
insert into Films(Filmid,Fname,Id,[Money],KSTime,JSTime,FilmTid,Remark)
 values('F0007','交换人生','FT3','49','2023-02-07 16:00:00','2023-02-07 18:00:00','T02'
 ,'如果交换人生会交换家人，你还愿意吗？仲达（雷佳音 饰）与金好（张小斐 饰）相亲后，意外和暗恋金好的少年陆小谷（张宥浩 饰）换身，并误打误撞交换了家人，开启了令人捧腹有笑有泪的奇“换”之旅……')
insert into Films(Filmid,Fname,Id,[Money],KSTime,JSTime,FilmTid,Remark)
 values('F0008','想见你','FT7','39','2023-02-07 19:00:00','2023-02-07 21:00:00','T02'
 ,'按下随身听的播放键，全新的故事在熟悉又陌生的恋人间展开…… 当李子维出现的那一刻，黄雨萱终于意识到，梦中经常见到的那个人，此刻就站在眼前。因为一个“想见你”的冲动，注定相爱的恋人们开启了命运牵绊。爱让一切有了曲折，也有了力量。 ')
insert into Films(Filmid,Fname,Id,[Money],KSTime,JSTime,FilmTid,Remark)
 values('F0009','穿靴子的猫2','FT5','33','2023-02-08 9:30:00','2023-02-08 11:30:00','T02'
 ,'喵！谁能拒绝喵星人毛茸茸的陪伴？橘猫顶流即将强势回归，为你带来抵御寒风的温暖能量。这次，传奇大侠靴猫将和老搭档新队友并肩开启怎样的全新冒险之旅呢？在不知不觉中挥霍掉了自己九条命中的八条的他为了找回失去的生命，即将踏上一段史诗般的旅程——进入黑森林寻找神话中的许愿星，许下“最后的愿望”。')
insert into Films(Filmid,Fname,Id,[Money],KSTime,JSTime,FilmTid,Remark)
 values('F0010','阿凡达：水之道','FT2','40','2023-02-08 9:30:00','2023-02-08 11:30:00','T02'
 ,'《阿凡达：水之道》设定在上一部影片的剧情落幕十余年后，讲述了萨利一家（杰克、奈蒂莉和孩子们）的故事：危机未曾消散，一家人拼尽全力彼此守护、奋力求生，并历经艰险磨难。')


























































